TRUNCATE TABLE public.methodic_questions RESTART IDENTITY CASCADE;
INSERT INTO public.methodic_questions (id,question_group,question,text_kz,quiz_id,question_type) VALUES
	 (1,'R','Починить сломанный бытовой прибор.','Бүлінген тұрмыстық құрылғыны жөндеу.',1,'single_choice'),
	 (2,'R','Высаживать деревья или участвовать в озеленении парка.','Ағаш отырғызу немесе саябақты көгалдандыруға қатысу.',1,'single_choice'),
	 (3,'R','Помогать в ремонте дома или школы.','Үйді немесе мектепті жөндеуге көмектесу.',1,'single_choice'),
	 (4,'R','Настроить компьютер или установить новое программное обеспечение.','Компьютерді баптау немесе жаңа бағдарламалық қамтамасыз етуді орнату.',1,'single_choice'),
	 (5,'I','Решать сложные математические задачи или головоломки.','Күрделі математикалық есептерді немесе жұмбақтарды шешу.',1,'single_choice'),
	 (6,'I','Исследовать экологические проблемы и искать пути их решения.','Экологиялық мәселелерді зерттеп, оларды шешу жолдарын іздеу.',1,'single_choice'),
	 (7,'I','Изучать поведение животных и их среды обитания.','Жануарлардың мінез-құлқын және оларды мекендеу ортасын зерттеу.',1,'single_choice'),
	 (8,'I','Участвовать в научных олимпиадах или конкурсах.','Ғылыми олимпиадаларға немесе конкурстарға қатысу.',1,'single_choice'),
	 (9,'A','Играть на музыкальном инструменте или брать уроки пения.','Музыкалық аспапта ойнау немесе вокал сабақтарын алу.',1,'single_choice'),
	 (10,'A','Рисовать, заниматься живописью или создавать цифровое искусство.','Сурет салу, кескіндеме немесе цифрлық өнер жасау.',1,'single_choice');
INSERT INTO public.methodic_questions (id,question_group,question,text_kz,quiz_id,question_type) VALUES
	 (11,'A','Снимать и монтировать видео или создавать анимацию.','Бейне түсіру және монтаждау немесе анимация жасау.',1,'single_choice'),
	 (12,'A','Танцевать или придумывать собственные танцевальные номера.','Би билеу немесе өз би нөмірлерін ойлап табу.',1,'single_choice'),
	 (13,'S','Помогать одноклассникам с учебой или проектами.','Сыныптастарына оқуда немесе жобаларда көмектесу.',1,'single_choice'),
	 (14,'S','Организовать благотворительную акцию или сбор вещей для нуждающихся.','Қайырымдылық акциясын ұйымдастыру немесе мұқтаждарға заттар жинау.',1,'single_choice'),
	 (15,'S','Обучать младших детей новым навыкам или проводить с ними время.','Кіші балаларды жаңа дағдыларға үйрету немесе олармен уақыт өткізу.',1,'single_choice'),
	 (16,'S','Участвовать в школьном совете или организации мероприятий.','Мектеп кеңесіне қатысу немесе іс-шаралар ұйымдастыру.',1,'single_choice'),
	 (17,'E','Начать небольшой бизнес по продаже своих поделок или услуг.','Өз қолөнерін немесе қызметтерін сату бойынша шағын бизнесті бастау.',1,'single_choice'),
	 (18,'E','Организовать школьный клуб по интересам.','Қызығушылық бойынша мектеп клубын ұйымдастыру.',1,'single_choice'),
	 (19,'E','Руководить командным проектом или группой.','Топтық жобаны немесе топты басқару.',1,'single_choice'),
	 (20,'E','Выступать с презентациями или докладами перед аудиторией.','Аудитория алдында презентациялар немесе баяндамалар жасау.',1,'single_choice');
INSERT INTO public.methodic_questions (id,question_group,question,text_kz,quiz_id,question_type) VALUES
	 (21,'C','Организовывать книги, файлы или цифровые документы.','Кітаптарды, файлдарды немесе цифрлық құжаттарды ұйымдастыру.',1,'single_choice'),
	 (22,'C','Создавать и заполнять таблицы в Excel или аналогичных программах.','Excel немесе ұқсас бағдарламаларда кестелер жасау және толтыру.',1,'single_choice'),
	 (23,'C','Следить за личными финансами или планировать бюджет мероприятия.','Жеке қаржыны бақылау немесе іс-шараның бюджетін жоспарлау.',1,'single_choice'),
	 (24,'C','Планировать расписание занятий или мероприятий.','Сабақтар немесе іс-шаралар кестесін жоспарлау.',1,'single_choice'),
	 (25,'N','Выберите интересуюшую область', 'Унайтын областты танданыз', 1, 'multiple_choice'),
	  (26,'N','Выберите интересуюш2wswую область', 'Унайтынsddsa областты танданыз', 1, 'multiple_choice');